; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	thermograph2 - mode
	thermograph1 - mode
	infrared0 - mode
	infrared3 - mode
	GroundStation1 - direction
	Star4 - direction
	GroundStation9 - direction
	Star6 - direction
	Star5 - direction
	GroundStation7 - direction
	Star2 - direction
	GroundStation8 - direction
	GroundStation3 - direction
	Star0 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 Star6)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument3 thermograph1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation8)
	(supports instrument4 infrared3)
	(supports instrument4 thermograph2)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 Star6)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument6 thermograph2)
	(supports instrument6 infrared0)
	(supports instrument6 infrared3)
	(calibration_target instrument6 Star5)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument7 thermograph1)
	(supports instrument7 infrared0)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star2)
	(calibration_target instrument7 GroundStation8)
	(calibration_target instrument7 Star5)
	(supports instrument8 thermograph1)
	(supports instrument8 infrared0)
	(calibration_target instrument8 GroundStation9)
	(calibration_target instrument8 Star0)
	(supports instrument9 thermograph2)
	(calibration_target instrument9 Star6)
	(calibration_target instrument9 GroundStation9)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon11)
	(supports instrument10 infrared0)
	(supports instrument10 thermograph2)
	(supports instrument10 infrared3)
	(calibration_target instrument10 Star2)
	(calibration_target instrument10 GroundStation7)
	(calibration_target instrument10 Star5)
	(supports instrument11 infrared3)
	(supports instrument11 thermograph2)
	(supports instrument11 thermograph1)
	(calibration_target instrument11 GroundStation3)
	(calibration_target instrument11 GroundStation8)
	(supports instrument12 thermograph1)
	(supports instrument12 thermograph2)
	(calibration_target instrument12 Star0)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon11)
)
(:goal (and
	(pointing satellite3 Phenomenon13)
	(pointing satellite4 GroundStation9)
	(have_image Star10 infrared0)
	(have_image Phenomenon11 infrared3)
	(have_image Planet12 infrared3)
	(have_image Phenomenon13 thermograph2)
	(have_image Planet14 infrared3)
))

)

; plan
1. (turn_to satellite1 star2 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star2)
   goals met: 0 of 7
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 7
3. (calibrate satellite1 instrument4 star2)
   added: (calibrated instrument4)
   goals met: 0 of 7
4. (turn_to satellite1 planet12 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet12)
   goals met: 0 of 7
5. (take_image satellite1 planet12 instrument4 infrared3)
   added: (have_image planet12 infrared3)
   goals met: 1 of 7
6. (turn_to satellite1 phenomenon13 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 7
7. (take_image satellite1 phenomenon13 instrument4 thermograph2)
   added: (have_image phenomenon13 thermograph2)
   goals met: 2 of 7
8. (turn_to satellite1 phenomenon11 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 7
9. (take_image satellite1 phenomenon11 instrument4 infrared3)
   added: (have_image phenomenon11 infrared3)
   goals met: 3 of 7
10. (turn_to satellite1 planet14 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet14)
   goals met: 3 of 7
11. (take_image satellite1 planet14 instrument4 infrared3)
   added: (have_image planet14 infrared3)
   goals met: 4 of 7
12. (turn_to satellite1 star10 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 star10)
   goals met: 4 of 7
13. (take_image satellite1 star10 instrument4 infrared0)
   added: (have_image star10 infrared0)
   goals met: 5 of 7
14. (turn_to satellite3 phenomenon13 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 phenomenon13)
   goals met: 6 of 7
15. (turn_to satellite4 groundstation9 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 groundstation9)
   goals met: 7 of 7
